package ru.gb;

/*
Задача:

Разработать приложение, аналог TODO лист.
Когда запускаем приложение, можем сами себе поставить ряд задач, а у каждой задачи будет состояние (выполнена/в работе) с возможностью отмечать статус.
Приложение можно закрывать -> все задачи со статусами сохраняются.
При новом открытии приложения -> все задачи затягиваются с момента предыдущего закрытия.
Сериализация не бинарная, чтобы можно было редактировать задаче без приложения.

 */

public class Main {
    public static void main(String[] args) {


    }
}